public class Main{
    public static void main(String[] args) {
        Interface.show();
    }
}

/*
TODO:
    - Появление кнопки ввода соответствия символов их коду при смене режима работы программы
    - Показ статистики сжатия после выполнения алгоритма
    - Сделать функцию создания словаря (символ-код) в backend.java. Кнопка просмотра появляется после первого прогона
        программы. Если кодирование, то просто показ, если декодирование, то ввод с показом введённого.
    - Сделать функцию нахождения подстроки для LZ78
*/
